#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_lambda_function.convert-jwt: Refreshing state... [id=convert-jwt]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.lambda_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:GenerateDataKey",
            ]
          + resources = [
              + "arn:aws:kms:eu-west-1:075673041815:key/8a8fde17-57c1-44bd-8e43-c1d8a87f3b88",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_cloudwatch_log_group.convert_jwt will be created
  + resource "aws_cloudwatch_log_group" "convert_jwt" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/convert-jwt"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # aws_iam_role_policy.lambda_policy will be created
  + resource "aws_iam_role_policy" "lambda_policy" {
      + id     = (known after apply)
      + name   = "lambda_policy"
      + policy = (known after apply)
      + role   = "iam_for_lambda"
    }

  # aws_lambda_function.convert-jwt will be destroyed
  # (because aws_lambda_function.convert-jwt is not in configuration)
  - resource "aws_lambda_function" "convert-jwt" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:eu-west-1:075673041815:function:convert-jwt" -> null
      - filename                       = "lambda.zip" -> null
      - function_name                  = "convert-jwt" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "convert-jwt" -> null
      - invoke_arn                     = "arn:aws:apigateway:eu-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-1:075673041815:function:convert-jwt/invocations" -> null
      - last_modified                  = "2022-05-09T13:58:36.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:eu-west-1:075673041815:function:convert-jwt:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::075673041815:role/iam_for_lambda" -> null
      - runtime                        = "python3.9" -> null
      - source_code_hash               = "BypOMAGGq0VGdBDOd1pggF3MHO0wkwu9xZ9FuXP3s0U=" -> null
      - source_code_size               = 15999309 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.convert_jwt will be created
  + resource "aws_lambda_function" "convert_jwt" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + filename                       = "lambda.zip"
      + function_name                  = "convert-jwt"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + kms_key_arn                    = "arn:aws:kms:eu-west-1:075673041815:key/8a8fde17-57c1-44bd-8e43-c1d8a87f3b88"
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::075673041815:role/iam_for_lambda"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "Z0cQn78i/22KW4+yjryaHKpD1IFTe37eGs53KsVOYGw="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CLIENT_ID"          = ""
              + "CLOUDFRONT_PK_PATH" = "/cloudfront/signer_key"
              + "JWKS_URI"           = ""
              + "KEY_ID"             = "APKARDHTW7OL4SWTL7AQ"
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_ssm_parameter.cloudfront_signer_key will be created
  + resource "aws_ssm_parameter" "cloudfront_signer_key" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "/cloudfront/signer_key"
      + tags_all  = (known after apply)
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @melvyndekort, Action: `pull_request`*